
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |    Add |   🟡 Change |    Destroy |
|:---------:|-------:|-----------:|-----------:|
|     ✅     |      0 |         10 |          0 |
## Affected resources by action

|  Action  | Resources                                                                   |
|:--------:|:----------------------------------------------------------------------------|
|    🟡     | `module.mail_twindb_com.aws_autoscaling_group.postfix`                      |
|    🟡     | `module.mail_twindb_com.aws_iam_policy.required`                            |
|    🟡     | `module.mail_twindb_com.aws_launch_template.postfix`                        |
|    🟡     | `module.release_infrahouse_com["focal"].aws_s3_object.index-html`           |
|    🟡     | `module.release_infrahouse_com["jammy"].aws_s3_object.index-html`           |
|    🟡     | `module.vpn.aws_autoscaling_group.openvpn`                                  |
|    🟡     | `module.vpn.aws_launch_template.openvpn`                                    |
|    🟡     | `module.vpn.module.instance_profile.aws_iam_policy.profile`                 |
|    🟡     | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website` |
|    🟡     | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0e5d85805b1236e19"
            name    = "postfix-20240326221552532900000008"
          ~ version = "9" -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ image_id                             = "ami-0ecaad63ed3668fca" -> "ami-0b03b9afed756bb4b"
      ~ latest_version                       = 9 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
        tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_object.index-html will be updated in-place
  ~ resource "aws_s3_object" "index-html" {
      ~ content                       = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
            <head>
                <meta charset="utf-8">
                <meta name="viewport" content="width=device-width, initial-scale=1">
                <meta name="description" content="InfraHouse Releases Repository">
                <title>InfraHouse Releases Repository</title>
            <body>
          - Stay tuned!
          + <!DOCTYPE html>
          + <html lang="en">
          + <head>
          +     <meta charset="utf-8">
          +     <meta name="viewport" content="width=device-width, initial-scale=1">
          +     <meta name="description" content="InfraHouse Ubuntu Packages Repository">
          +     <style>
          +         pre {
          +             display: block;
          +             font-family: monospace;
          +             white-space: pre;
          +             border-style: dotted;
          +             margin: 30px;
          +             padding: 10px;
          +         }
          +     </style>
          +     <title>InfraHouse Ubuntu Packages Repository</title>
          + <body>
          + <h1>Installation instructions</h1>
          + 
          + <p>Download the repository public key and convert it into apt compatible format.</p>
          + <pre>
          + # Install dependencies
          + apt-get update
          + apt-get install gpg lsb-release curl
          + 
          + # Add a GPG public key to verify InfraHouse packages
          + mkdir -p /etc/apt/cloud-init.gpg.d/
          + curl  -fsSL https://release-$(lsb_release -cs).infrahouse.com/DEB-GPG-KEY-release-$(lsb_release -cs).infrahouse.com \
          +     | gpg --dearmor -o /etc/apt/cloud-init.gpg.d/infrahouse.gpg
          + </pre>
          + 
          + <p>Add the InfraHouse repository source.</p>
          + 
          + <pre>
          + echo "deb [signed-by=/etc/apt/cloud-init.gpg.d/infrahouse.gpg] https://release-$(lsb_release -cs).infrahouse.com/ $(lsb_release -cs) main" \
          +     > /etc/apt/sources.list.d/infrahouse.list
          + 
          + apt-get update
          + </pre>
            </body>
          + 
          + </body>
        EOT
        id                            = "index.html"
        tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_object.index-html will be updated in-place
  ~ resource "aws_s3_object" "index-html" {
      ~ content                       = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
            <head>
                <meta charset="utf-8">
                <meta name="viewport" content="width=device-width, initial-scale=1">
                <meta name="description" content="InfraHouse Releases Repository">
                <title>InfraHouse Releases Repository</title>
            <body>
          - Stay tuned!
          + <!DOCTYPE html>
          + <html lang="en">
          + <head>
          +     <meta charset="utf-8">
          +     <meta name="viewport" content="width=device-width, initial-scale=1">
          +     <meta name="description" content="InfraHouse Ubuntu Packages Repository">
          +     <style>
          +         pre {
          +             display: block;
          +             font-family: monospace;
          +             white-space: pre;
          +             border-style: dotted;
          +             margin: 30px;
          +             padding: 10px;
          +         }
          +     </style>
          +     <title>InfraHouse Ubuntu Packages Repository</title>
          + <body>
          + <h1>Installation instructions</h1>
          + 
          + <p>Download the repository public key and convert it into apt compatible format.</p>
          + <pre>
          + # Install dependencies
          + apt-get update
          + apt-get install gpg lsb-release curl
          + 
          + # Add a GPG public key to verify InfraHouse packages
          + mkdir -p /etc/apt/cloud-init.gpg.d/
          + curl  -fsSL https://release-$(lsb_release -cs).infrahouse.com/DEB-GPG-KEY-release-$(lsb_release -cs).infrahouse.com \
          +     | gpg --dearmor -o /etc/apt/cloud-init.gpg.d/infrahouse.gpg
          + </pre>
          + 
          + <p>Add the InfraHouse repository source.</p>
          + 
          + <pre>
          + echo "deb [signed-by=/etc/apt/cloud-init.gpg.d/infrahouse.gpg] https://release-$(lsb_release -cs).infrahouse.com/ $(lsb_release -cs) main" \
          +     > /etc/apt/sources.list.d/infrahouse.list
          + 
          + apt-get update
          + </pre>
            </body>
          + 
          + </body>
        EOT
        id                            = "index.html"
        tags                          = {
            "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.vpn.data.aws_iam_policy_document.instance_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "instance_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:ModifyInstanceAttribute",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "openvpn-2024070518392010580000001e-nRBgZQ",
                ]
              + variable = "ec2:ResourceTag/aws:autoscaling:groupName"
            }
        }
    }

  # module.vpn.aws_autoscaling_group.openvpn will be updated in-place
  ~ resource "aws_autoscaling_group" "openvpn" {
        id                               = "openvpn-2024070518392010580000001e-nRBgZQ"
        name                             = "openvpn-2024070518392010580000001e-nRBgZQ"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0f7a032c61f3f5094"
            name    = "openvpn-2024070518392010580000001e"
          ~ version = "2" -> (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # module.vpn.aws_launch_template.openvpn will be updated in-place
  ~ resource "aws_launch_template" "openvpn" {
        id                                   = "lt-0f7a032c61f3f5094"
      ~ image_id                             = "ami-0ecaad63ed3668fca" -> "ami-0b03b9afed756bb4b"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "openvpn-2024070518392010580000001e"
        tags                                 = {
            "created_by_module" = "infrahouse/openvpn/aws"
            "service"           = "openvpn"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.instance_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/openvpn-8u1hU4OyuQDT20240705183937201200000024"
        name             = "openvpn-8u1hU4OyuQDT20240705183937201200000024"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:GetCallerIdentity"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "ec2:ModifyInstanceAttribute"
                      - Condition = {
                          - StringEquals = {
                              - "ec2:ResourceTag/aws:autoscaling:groupName" = "openvpn-2024070518392010580000001e-nRBgZQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0ef83181fbf251354"
            name    = "openvp20240705183917137600000019"
          ~ version = "1" -> (known after apply)
        }

        # (9 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ image_id                             = "ami-05847801b5213b5e1" -> "ami-0000fe44649a08f57"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 10 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiAxMCwgImRlc3Ryb3kiOiAwfX0=
```
</details>